app/views/services/_form.html.erb

SELECT `employees`.*, employees.id FROM `employees` INNER JOIN `employee_services` ON `employees`.id = `employee_services`.employee_id WHERE ((`employee_services`.service_id = NULL))
---
                        <div id="select_employees" style="display:block; float: left">
                          <%= f.select :employee_ids, options_for_select(Employee.all(:select => "name, id").map {|r| [r.name,r.id] }, (params[:service] ? params[:service][:employee_ids] : @service.employees.all(:select => "employees.id").map{|l| [l.id]})), {}, {:multiple => true, :size => 6, :style => 'min-width:100px'} %>

SELECT `rooms`.*, rooms.id FROM `rooms` INNER JOIN `room_services` ON `rooms`.id = `room_services`.room_id WHERE ((`room_services`.service_id = NULL))
---
                        <div id="select_rooms" style="display:block; float: right; padding-right: 50px">
                          <%= f.select :room_ids, options_for_select(Room.all(:select => "name, id").map {|r| [r.name,r.id] }, (params[:service] ? params[:service][:room_ids] : @service.rooms.all(:select => "rooms.id").map{|l| [l.id]})), {}, {:multiple => true, :size => 6, :style => 'min-width:100px'} %>

SELECT `products`.* FROM `products`
---
                          <% product_ids = [] %>
                          <% Product.all.each do |product| %>

SELECT `equipments`.*, equipments.id FROM `equipments` INNER JOIN `equipments_services` ON `equipments`.id = `equipments_services`.equipment_id WHERE ((`equipments_services`.service_id = NULL))
---
                      <div>
                        <%= f.select :equipment_ids, options_for_select(Equipment.all(:select => "name, id").map {|r| [r.name,r.id] }, (params[:service] ? params[:service][:equipment_ids] : @service.equipments.all(:select => "equipments.id").map{|l| [l.id]})), {}, {:multiple => true, :size => 6, :style => 'min-width:100px'} %>