app/views/guests/index.html.erb

                    <div class="dataheaddivwhite" style="width:170px ">
                      <%= guest.packages.empty? ? "None" : guest.packages.map{|r| r.name}.join(' , ') %>
---
SELECT COUNT(*) FROM `packages` INNER JOIN `guest_packages` ON `packages`.id = `guest_packages`.package_id WHERE ((`guest_packages`.guest_id = 1))