app/views/guests/new.html.erb

                <td>Spa Location</td>
                <% @locations = Location.all %>
---
SELECT `locations`.* FROM `locations`

                <td>Membership</td>
                <% @memberships = Membership.all %>
---
SELECT `memberships`.* FROM `memberships`

                <td>
                  <%= f.select :packages_ids, options_for_select(Package.all(:select => "name, id").map {|r| [r.name,r.id] }, (params[:guest] ? params[:guest][:packages_ids] : @guest.packages.all(:select => "packages.id").map{|l| l.id})), {}, {:multiple => true, :size => 5} %>
---
SELECT `packages`.*, packages.id FROM `packages` INNER JOIN `guest_packages` ON `packages`.id = `guest_packages`.package_id WHERE ((`guest_packages`.guest_id = NULL))

                    Preferred Staff:
                    <% @employees = Employee.all(:conditions => ["gender = 'Male'"] ) %>
---
SELECT `employees`.* FROM `employees` WHERE (gender = 'Male')