app/views/users/_user.html.erb

                Location Outlet
                <% @locations = Location.all(:conditions => ["country = 'Singapore'"]) %>
---
SELECT `locations`.* FROM `locations` WHERE (country = 'Singapore')