app/views/payments/_form.html.erb

                  <td>
                    <%= f.select :guest_id,[["Select"]]+Guest.all(:select => "name, id").map{|guest| [guest.name, guest.id]} %>
---
SELECT name, id FROM `guests`

                  <td><b>Staff name</b></td>
                  <td><%= f.select :employee_id,[["Select"]]+Employee.all(:select => "name, id").map{|employee| [employee.name, employee.id]} %>
---
SELECT name, id FROM `employees`

                  <td>
                    <% @packages = Package.all %>
---
SELECT `packages`.* FROM `packages`

                  <td>
                    <%= f.select :service_ids, options_for_select(Service.all(:select => "service_name, id").map {|r| [r.service_name,r.id] }, (params[:payment] ? params[:payment][:service_ids] : @payment.services.all(:select => "services.id").map{|l| l.id})), {}, {:multiple => true, :size => 5} %>
---
SELECT `services`.*, services.id FROM `services` INNER JOIN `payment_services` ON `services`.id = `payment_services`.service_id WHERE ((`payment_services`.payment_id = NULL))

                        <% product_ids = [] %>
                        <% Product.all.each do |product| %>
---
SELECT `products`.* FROM `products`

                  <td><b>Gift Voucher</b></td>
                  <% @gift_vouchers = GiftVoucher.all %>
---
SELECT `gift_vouchers`.* FROM `gift_vouchers`