app/views/rooms/_form.html.erb

SELECT `locations`.* FROM `locations` WHERE (country = 'Singapore')
---
                  <td>Location Outlet</td>
                  <% @locations = Location.all(:conditions => "country = 'Singapore'") %>

SELECT `services`.*, services.id FROM `services` INNER JOIN `room_services` ON `services`.id = `room_services`.service_id WHERE ((`room_services`.room_id = NULL))
---
                  <td>
                    <%= f.select :service_ids, options_for_select(Service.all(:select => "service_name, id").map {|r| [r.service_name,r.id] }, (params[:room] ? params[:room][:service_ids] : @room.services.all(:select => "services.id").map{|l| [l.id]})), {}, {:multiple => true, :size => 3} %>