app/controllers/appointments_controller.rb

  def index
    per_page = params[:per_page] || 10
    params[:order] = params[:order] || 'guest_id'
    params[:by] = params[:by] || 'ASC'
    @appointments = Appointment.paginate(:all,:page => params[:page] , :per_page=> per_page, :order => params[:order]+ ' '+params[:by])
---
SELECT `appointments`.* FROM `appointments` ORDER BY guest_id ASC LIMIT 10 OFFSET 0