app/controllers/categories_controller.rb

  def show
    @category = Category.find(params[:id])
---
SELECT `sub_categories`.* FROM `sub_categories` WHERE (`sub_categories`.category_id = 1)

  def add_sub_category
    @category = Category.find(params[:id])
    if params[:name].to_s.blank?
      flash[:error] = "Please enter sub-category name and press on create button."
    else
      @sub_category = SubCategory.new(:name => params[:name], :category_id => @category.id)
      if @sub_category.save
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
INSERT INTO `sub_categories` (`name`, `updated_at`, `created_at`, `category_id`) VALUES ('xbchgn', '2011-08-23 10:28:31', '2011-08-23 10:28:31', 1)

  def create
    @category = Category.new(params[:category])
    if @category.save
---
INSERT INTO `categories` (`created_at`, `updated_at`, `name`) VALUES ('2011-08-23 10:28:02', '2011-08-23 10:28:02', '434353xfsdsg')

  def get_sub_categories
    @category = Category.find(params[:id])
---
SELECT `sub_categories`.* FROM `sub_categories` WHERE (`sub_categories`.category_id = 1)