app/controllers/guests_controller.rb

SELECT `guests`.* FROM `guests` WHERE (status !='Deleted') ORDER BY name ASC LIMIT 10 OFFSET 0
---
  def index
    per_page = params[:per_page] || 10
    params[:order] = params[:order] || 'name'
    params[:by] = params[:by] || 'ASC'
    @guests = Guest.paginate(:all, :conditions => ["status !='Deleted'"], :page => params[:page], :per_page => per_page, :order => params[:order]+' '+params[:by])

INSERT INTO `guests` (`shipping_street`, `email_alerts`, `avatar_file_name`, `last_visited_at`, `allergies`, `date_of_anniversary`, `shipping_country`, `avatar_file_size`, `avatar_updated_at`, `date_of_birth`, `employee_id`, `created_at`, `status`, `shipping_address_two`, `shipping_pin_code`, `billing_address_one`, `shipping_telephone`, `billing_country`, `membership_id`, `billing_telephone`, `name`, `billing_street`, `location_id`, `avatar_content_type`, `updated_at`, `shipping_mobile`, `formulas`, `billing_address_two`, `sms_alerts`, `billing_mobile`, `gender`, `shipping_address_one`, `email`, `preferred_person`, `shipping_city`, `billing_pin_code`, `billing_city`) VALUES ('', 1, NULL, NULL, NULL, '1900-01-01', 'Kazakhstan', NULL, NULL, '1901-02-01', NULL, '2011-08-23 08:26:02', 'Active', 'h', 23432, 'df', 989890, 'Aland Islands', NULL, 9908908, 'Ashwin', '', 1, NULL, '2011-08-23 08:26:02', 7878978979, NULL, 'df', 1, 908908098908, 'Male', 'hh', 'ashwin@carmatec.com', NULL, 'hhkjlh', 636, 'dfdg')
---
  def create
    @guest = Guest.new(params[:guest])
    @guest.assign_packages(params[:guest][:packages_ids])
    @guest.status = 'Active'
    if @guest.save and @guest.guest_custom_field.build(params[:guest_custom_field])