app/controllers/locations_controller.rb

SELECT `locations`.* FROM `locations` WHERE (status !='Deleted') ORDER BY name ASC LIMIT 10 OFFSET 0
---
  def index
    per_page = params[:per_page] || 10
    params[:order] = params[:order] || 'name'
    params[:by] = params[:by] || 'ASC'
    @locations = Location.paginate(:all, :conditions => ["status !='Deleted'"], :page => params[:page], :per_page => per_page, :order => params[:order]+' '+params[:by])

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1
SELECT `location_operation_hours`.* FROM `location_operation_hours` WHERE (operating_date in('2011-08-22','2011-08-23','2011-08-24','2011-08-25','2011-08-26','2011-08-27','2011-08-28') and location_id = '1')
---
  def show
    @location = Location.find(params[:id])
    cweek = Date.today.cweek
    @current_wkBegin = Date.commercial(Date.today.year, cweek, 1)
    @current_wkEnd = Date.commercial(Date.today.year, cweek, 7)
    @location_operating_hours = LocationOperationHour.all(:conditions => ["operating_date in(?) and location_id = ?",  (@current_wkBegin..@current_wkEnd), params[:id]])

INSERT INTO `locations` (`address2`, `code_number`, `status`, `phone2`, `name`, `address1`, `country`, `created_at`, `location_email_id`, `post_code`, `phone1`, `street`, `fax`, `city`, `updated_at`) VALUES ('dsqqjgfsjg', '23432', 'Active', 4532145, 'Market', 'asdj', 'India', '2011-08-23 08:07:15', 'safdj@gsmg.com', 0, 2543254, 'dsqjg;kasj', 'fwf1454354', 'gdsjgkl', '2011-08-23 08:07:15')
---
  def create
    @location = Location.new(params[:location])
    @location.status = 'Active'
    if @location.save

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
---
  def get_operation_hours
    @location = Location.find(params[:id])

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
INSERT INTO `location_operation_hours` (`close_time`, `open_time`, `operating_day`, `location_id`, `operating_date`) VALUES ('2000-01-01 20:00:00', '2000-01-01 10:00:00', 'Saturday', 2, '2011-01-01')
---
  def create_operation_hours
    @location = Location.find(params[:id])
    save_status = false
    (("01/01/2011".to_datetime)..("12/31/2011".to_datetime)).each do |store_day|
      if LocationOperationHour.create(:location_id => @location.id, :operating_day => store_day.strftime('%A'), :operating_date => store_day.to_date, :open_time => params[:"#{store_day.strftime('%A')}_open_time"], :close_time => params[:"#{store_day.strftime('%A')}_close_time"] )

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
SELECT `location_operation_hours`.* FROM `location_operation_hours` WHERE (operating_date = '2011-08-22' and location_id = '2') LIMIT 1
UPDATE `location_operation_hours` SET `open_time` = '2011-08-22 05:15:00' WHERE `location_operation_hours`.`id` = 234
---
  def update_operation_time
    @location = Location.find(params[:id])
    @location_operating_hour = LocationOperationHour.first(:conditions => ["operating_date = ? and location_id = ?", params[:operate_date].to_date, params[:id]])
    location_open_time = (params[:time_value].to_time.year.to_s+'-'+(params[:time_value].to_time.month.to_s.length == 1 ? '0'+params[:time_value].to_time.month.to_s : params[:time_value].to_time.month.to_s )+'-'+(params[:time_value].to_time.day.to_s.length == 1 ? '0'+params[:time_value].to_time.day.to_s : params[:time_value].to_time.day.to_s)+' '+(@location_operating_hour.open_time.hour.to_s.length == 1 ? '0'+@location_operating_hour.open_time.hour.to_s : @location_operating_hour.open_time.hour.to_s)+':'+(@location_operating_hour.open_time.min.to_s.length == 1 ? '0'+@location_operating_hour.open_time.min.to_s : @location_operating_hour.open_time.min.to_s)).to_time
    location_close_time = (params[:time_value].to_time.year.to_s+'-'+(params[:time_value].to_time.month.to_s.length == 1 ? '0'+params[:time_value].to_time.month.to_s : params[:time_value].to_time.month.to_s )+'-'+(params[:time_value].to_time.day.to_s.length == 1 ? '0'+params[:time_value].to_time.day.to_s : params[:time_value].to_time.day.to_s)+' '+(@location_operating_hour.close_time.hour.to_s.length == 1 ? '0'+@location_operating_hour.close_time.hour.to_s : @location_operating_hour.close_time.hour.to_s)+':'+(@location_operating_hour.close_time.min.to_s.length == 1 ? '0'+@location_operating_hour.close_time.min.to_s : @location_operating_hour.close_time.min.to_s)).to_time
    if @location_operating_hour.nil?
      message = "<span style='color: red'>Error, please try again.</span>"
    elsif params[:schedule_type] == 'open_time' and (location_close_time <= params[:time_value].to_time)
      message = "<span style='color: red'>*Should be less than close time</span>"
    elsif params[:schedule_type] == 'close_time' and (location_open_time >= params[:time_value].to_time)
      message = "<span style='color: red'>*Should be more than open time</span>"
    elsif @location_operating_hour.update_attribute(:"#{params[:schedule_type]}", params[:time_value].to_time)

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
---
  def closed_dates
    @location = Location.find(params[:id])

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
---
  def new_closed_date
    @location = Location.find(params[:id])

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
SELECT `location_closed_dates`.`id` FROM `location_closed_dates` WHERE `location_closed_dates`.`closed_date` = '2011-08-24' LIMIT 1
INSERT INTO `location_closed_dates` (`closed_date`, `description`, `location_id`, `created_by`) VALUES ('2011-08-27', 'dsdgfdghdfh', 2, 'spabooker')
---
  def add_closed_date
    @location = Location.find(params[:id])
    if params[:location_closed_date][:closed_date].to_s.blank? or params[:location_closed_date][:description].to_s.blank?
      render :update do |page|
        page << "$('#closed_dates_messages').show()"

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
SELECT `location_closed_dates`.* FROM `location_closed_dates` WHERE `location_closed_dates`.`id` = 1 LIMIT 1
---
  def edit_closed_date
    @location = Location.find(params[:id])
    @location_closed_date = LocationClosedDate.find(params[:closed_date_id])

SELECT id,name FROM `locations` WHERE (country = 'Afghanistan')
---
  def get_outlets
    @locations = Location.find(:all, :conditions => ['country = ?', params[:country]], :select => 'id,name')