app/controllers/payments_controller.rb

  def index
    per_page = params[:per_page] || 10
    @payments = Payment.paginate(:all,:page => params[:page] , :per_page=> per_page)
---
SELECT `payments`.* FROM `payments` LIMIT 10 OFFSET 0

  def create
    @payment = Payment.new(params[:payment])
    @payment.payment_mode = params[:payment_mode]
    if params[:payment_mode] == 'Cash'
      @payment.cash_card_number = params[:cash]
    else
      @payment.cash_card_number = params[:card_type]+'-'+params[:card_number]
    end
    if @payment.save
      #      if !params[:payment][:service_ids].empty?
      #        params[:payment][:service_ids].each do |service_id|
      #          PaymentService.create(:payment_id => @payment.id, :service_id => service_id)
      #        end
      #      end
      @products = Product.all
---
SELECT `products`.* FROM `products`