app/controllers/profiles_controller.rb

  def index
    per_page = params[:per_page] || 10
    params[:order] = params[:order] || 'first_name'
    params[:by] = params[:by] || 'ASC'
    @profiles = Profile.paginate(:all, :conditions => ["status !='Deleted'"], :page => params[:page], :per_page => per_page, :order => params[:order]+' '+params[:by])
---
SELECT `profiles`.* FROM `profiles` WHERE (status !='Deleted') ORDER BY first_name ASC LIMIT 10 OFFSET 0