app/controllers/rooms_controller.rb

  def index
    per_page = params[:per_page] || 10
    params[:order] = params[:order] || 'name'
    params[:by] = params[:by] || 'ASC'
    @rooms = Room.paginate(:all, :conditions => ["status !='Deleted'"], :page => params[:page], :per_page => per_page, :order => params[:order]+' '+params[:by])
---
SELECT `rooms`.* FROM `rooms` WHERE (status !='Deleted') ORDER BY name ASC LIMIT 10 OFFSET 0