app/controllers/services_controller.rb

SELECT `sub_categories`.* FROM `sub_categories`
---
  def new
    @service = Service.new
    @categories = Category.all

INSERT INTO `services` (`updated_at`, `category_id`, `staff_recovery_time`, `sub_category_id`, `status`, `rate`, `duration`, `requires_equipment`, `room_recovery_time`, `service_name`, `service_code`, `special_notes`, `book_online`, `created_at`) VALUES ('2011-08-23 10:28:52', 1, '2011-08-23 10:25:00', 1, 'Active', '34343', '2011-08-23 10:25:00', 0, '2011-08-23 10:25:00', 'serever', '43436', 'w343', 1, '2011-08-23 10:28:52')
SELECT name, id FROM `employees`
SELECT name, id FROM `rooms`
SELECT name, id FROM `equipments`
SELECT `products`.* FROM `products`
---
  def create
    @service = Service.new(params[:service])
    @service.status = 'Active'
    if @service.save
      if params[:applied_to_employee] == '1' and !params[:service][:employee_ids].empty?
        params[:service][:employee_ids].each do |employee_id|
          EmployeesService.create(:employee_id => employee_id, :service_id => @service.id)
        end
      end
      if params[:applied_to_room] == '1' and !params[:service][:room_ids].empty?
        params[:service][:room_ids].each do |room_id|
          RoomService.create(:room_id => room_id, :service_id => @service.id)
        end
      end
      if params[:service][:requires_equipment] == '1' and !params[:service][:equipment_ids].empty?
        params[:service][:equipment_ids].each do |equipment_id|
          EquipmentsService.create(:equipment_id => equipment_id, :service_id => @service.id)
        end
      end
      @products = Product.all

SELECT `sub_categories`.* FROM `sub_categories`
---
      redirect_to services_path
    else
      flash.now[:error] = "Couldn't create the new service, plase try again."
      @categories = Category.all