app/controllers/users_controller.rb

INSERT INTO `role_users` (`created_at`, `role_id`, `user_id`, `updated_at`) VALUES ('2011-08-23 08:02:12', 1, 1, '2011-08-23 08:02:12')
INSERT INTO `users` (`current_login_at`, `employee_id`, `email`, `password_salt`, `perishable_token`, `failded_login_count`, `last_login_ip`, `login_count`, `login`, `single_access_token`, `crypted_password`, `last_login_at`, `last_request_at`, `created_at`, `active`, `persistence_token`, `primary_location_id`, `current_login_ip`, `updated_at`) VALUES (NULL, NULL, 'spabooker@spabooker.com', 'VmLql1QyXl2fE7rihgm3', 'BWLtwKSeN05ix5VAnmmM', 0, NULL, 0, 'spabooker', 'l9MR1YxO13NelKaCk9gK', 'c2ef8cc0517aebaf6c7996c65517b5921912c6e16bd54acac7c41511871fbcda57511bbb397d604e7356d178a2696be4ba510d1633b42182bb47702bcf80a362', NULL, NULL, '2011-08-23 08:02:11', 0, 'cc7007dabeb3fc93af1d1e73cf0e05e326666dc2e7a1d4c1978f239dc2c221f34752981cb77cf4418d72601fbfce9bb2bb2377b27e896dbbfda96394660f5526', 1, NULL, '2011-08-23 08:02:11')
SELECT `roles`.* FROM `roles` WHERE `roles`.`name` = 'User' LIMIT 1
---
  def create
    @user = User.new(params[:user])
    if @user.errors.empty? and @user.save_without_session_maintenance
      @user.activation_instructions
      user_role = Role.find_by_name('User')

SELECT `users`.* FROM `users` WHERE (perishable_token = 'sLw8WpfLJk7He8aqV9j4' and updated_at > '2011-08-16 08:02:34') LIMIT 1
---
  def activate
    @user = User.find_using_perishable_token(params[:activation_code], 1.week) || (raise  Exception)